Repository: Unixcision/uniconnect
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.hooks.usage
source: Usage: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Manage and run UniConnect agent hooks without adding one top-level command per agent. Claude Code hooks are injected automatically by the UniConnect Claude wrapper. Agents: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Hook targets: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Generated files: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Examples: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
ar: الاستخدام: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] إدارة وتشغيل عمليات ربط الوكيل UniConnect دون إضافة أمر واحد من المستوى الأعلى لكل وكيل. Claude يتم إدخال خطافات التعليمات البرمجية تلقائيًا بواسطة الغلاف UniConnect Claude. الوكلاء: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder أهداف الخطاف: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge الملفات التي تم إنشاؤها: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. أمثلة: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
bs: Upotreba: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Upravljajte i pokrenite UniConnect agentske kuke bez dodavanja jedne naredbe najvišeg nivoa po agent. Claude Kuke koda se automatski ubrizgavaju pomoću UniConnect Claude omotača. Agenti: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Udica meta: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Generirani fajlovi: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. primjeri: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
da: Anvendelse: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Administrer og kør UniConnect agenthooks uden at tilføje én kommando på øverste niveau pr. agent. Claude Kodekroge indsprøjtes automatisk af UniConnect Claude indpakningen. Agenter: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Krogmål: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Genererede filer: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Eksempler: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
de: Verwendung: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Verwalten und führen Sie UniConnect Agent-Hooks aus, ohne jeweils einen Befehl der obersten Ebene hinzuzufügen Agent. Claude Code-Hooks werden automatisch vom Wrapper UniConnect Claude eingefügt. Agenten: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Hook-Ziele: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Erzeugte Dateien: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Beispiele: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
es: Uso: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Gestiona y ejecuta hooks de agentes de UniConnect sin añadir un comando de nivel superior por agente. Los hooks de Claude Code se inyectan automáticamente mediante el wrapper de Claude de UniConnect. Agentes: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Destinos de hooks: setup Instala hooks para todos los agentes compatibles presentes en PATH uninstall Elimina los hooks de todos los agentes compatibles <agent> install Instala la integración de un agente <agent> uninstall Elimina la integración de un agente <agent> <event> Punto de entrada interno usado por las configuraciones generadas feed Puente interno de decisiones de Feed Archivos generados: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json Consulta docs/agent-hooks.md para ver la matriz de integración completa. Ejemplos: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
fr: Utilisation : cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Gérez et exécutez UniConnect hooks d'agent sans ajouter une commande de niveau supérieur par mandataire. Claude Les hooks de code sont injectés automatiquement par le wrapper UniConnect Claude. Agents : codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Cibles de crochet : setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Fichiers générés : ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Exemples : cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
it: Utilizzo: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Gestisci ed esegui UniConnect hook dell'agente senza aggiungere un comando di livello superiore per agente. Claude Gli hook di codice vengono inseriti automaticamente dal wrapper UniConnect Claude. Agenti: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Obiettivi del gancio: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge File generati: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Esempi: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
ja: 使用法: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] エージェント フックごとに最上位コマンドを 1 つ追加せずに、UniConnect エージェント フックを管理および実行します。 エージェント。Claude コードフックは、UniConnect Claude ラッパーによって自動的に挿入されます。 エージェント: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder フックターゲット: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge 生成されたファイル: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. 例: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
km: ការប្រើប្រាស់៖ ការដំឡើងទំពក់ cmux [ភ្នាក់ងារ] [--agent <name>] [--yes|-y]: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] គ្រប់គ្រង និងដំណើរការ UniConnect ទំពក់ភ្នាក់ងារដោយមិនបន្ថែមពាក្យបញ្ជាកម្រិតកំពូលមួយក្នុងមួយ ភ្នាក់ងារ។Claude ទំពក់លេខកូដត្រូវបានចាក់ដោយស្វ័យប្រវត្តិដោយUniConnect Claude ។ ភ្នាក់ងារ៖: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder គោលដៅទំពក់៖: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge ឯកសារដែលបានបង្កើត៖: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. ឧទាហរណ៍៖: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
ko: 사용법: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] 하나의 최상위 명령을 추가하지 않고도 UniConnect 에이전트 후크를 관리하고 실행합니다. 대리인. Claude 코드 후크는 UniConnect Claude 래퍼에 의해 자동으로 삽입됩니다. 대리인: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder 후크 대상: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge 생성된 파일: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. 예: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
nb: Bruk: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Administrer og kjør UniConnect agenthooks uten å legge til én kommando på toppnivå pr. agent. Claude Kodekroker injiseres automatisk av UniConnect Claude omslag. Agenter: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Krokmål: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Genererte filer: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Eksempler: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
pl: Użycie: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Zarządzaj i uruchamiaj UniConnect zaczepy agentów bez dodawania jednego polecenia najwyższego poziomu na agent. Claude Haki kodu są wstrzykiwane automatycznie przez opakowanie UniConnect Claude. Agenci: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Cele haków: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Wygenerowane pliki: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Przykłady: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
pt_br: Uso: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Gerencie e execute ganchos de agente UniConnect sem adicionar um comando de nível superior por agente. Claude Os ganchos de código são injetados automaticamente pelo UniConnect Claude wrapper. Agentes: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Alvos de gancho: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Arquivos gerados: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Exemplos: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
ru: Использование: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Управляйте и запускайте перехватчики агентов UniConnect без добавления одной команды верхнего уровня для каждого агент. Claude Перехватчики кода автоматически внедряются оболочкой UniConnect Claude. Агенты: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Цели крючка: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Сгенерированные файлы: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Примеры: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
th: การใช้งาน: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] จัดการและรัน UniConnect agent hooks โดยไม่ต้องเพิ่มคำสั่งระดับบนสุดหนึ่งคำสั่งต่อ ตัวแทนClaude hook รหัสจะถูกฉีดโดยอัตโนมัติโดย wrapper UniConnect Claude ตัวแทน: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder เป้าหมายตะขอ: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge ไฟล์ที่สร้างขึ้น: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. ตัวอย่าง: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
tr: Kullanım: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] UniConnect ajan kancalarını, başına bir üst düzey komut eklemeden yönetin ve çalıştırın. ajan. Claude Kod kancaları UniConnect Claude sarmalayıcı tarafından otomatik olarak eklenir. Temsilciler: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Kanca hedefleri: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Oluşturulan dosyalar: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. Örnekler: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
uk: Використання: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] Керуйте та запускайте підключення агента UniConnect без додавання однієї команди верхнього рівня на агент. Claude Перехоплювачі коду вставляються автоматично обгорткою UniConnect Claude. Агенти: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder Гакові цілі: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge Згенеровані файли: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. приклади: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
zh_hans: 用法： cmux hooks setup [agent] [--agent <name>] [--yes|-y]: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] 管理和运行 UniConnect 代理挂钩，无需为每个代理添加一个顶级命令 代理。Claude 代码钩子由 UniConnect Claude 包装器自动注入。 代理商：: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder 钩子目标：: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge 生成的文件：: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. 示例：: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
zh_hant: 用法： cmux hooks setup [agent] [--agent <name>] [--yes|-y]: cmux hooks setup [agent] [--agent <name>] [--yes|-y] cmux hooks uninstall [agent] [--agent <name>] [--yes|-y] cmux hooks <agent> install [--yes|-y] (opencode supports --project) cmux hooks <agent> uninstall [--yes|-y] (opencode supports --project) cmux hooks <agent> <event> [flags] cmux hooks feed --source <agent> [--event <event>] 管理和運行 UniConnect 代理掛鉤，無需為每個代理程式新增一個頂級命令 代理。Claude 程式碼鉤子由 UniConnect Claude 包裝器自動注入。 代理商：: codex, grok, opencode, pi, omp, amp, cursor, gemini, kiro, antigravity (alias: agy), rovodev (alias: rovo), hermes-agent, copilot, codebuddy, factory, qoder 鉤子目標：: setup Install hooks for all supported agents on PATH uninstall Remove hooks for all supported agents <agent> install Install one agent integration <agent> uninstall Remove one agent integration <agent> <event> Internal hook entrypoint used by generated configs feed Internal Feed decision bridge 產生的文件：: ~/.config/opencode/plugins/uniconnect-session.js ~/.config/opencode/plugins/uniconnect-feed.js ~/.pi/agent/extensions/uniconnect-session.ts ~/.omp/agent/extensions/uniconnect-omp-session.ts ~/.config/amp/plugins/uniconnect-session.ts ~/.kiro/agents/uniconnect.json See docs/agent-hooks.md for the full integration matrix. 範例：: cmux hooks setup cmux hooks setup --agent codex cmux hooks setup rovo cmux hooks setup omp cmux hooks uninstall rovo cmux hooks codex install cmux hooks opencode install --project cmux hooks uninstall
